#include<stdio.h>//array.c
#include<conio.h>
int main(){
    /*បង្កើតអីរ៉េ
    ប្រភេទទិន្នន័យ​​​​​​​​    ឈ្មោះអីរ៉េចំនួនធាតុ*/
    int nums[5];//បង្កើតអីរ៉េដាក់ឈ្មោះសម្គាល់nums  ដែកមានធាតុចំនួន5៕
    nums[0]=10;//ផ្ដល់តម្លៃលេខ១០ទៅឪ្យធាតុទី១ដែលមានលេខសម្គាល់០៕
    nums[1]=20;
    nums[2]=30;
    nums[3]=40;
    nums[4]=50;
    int i;
    i=0;
    int j;
    j=0;
    //បង្កើតអីរ៉េnumes   ដែលផ្ដល់លេខ១០០ទៅឪ្តធាតុទី១លេខ២០០ទៅឪ្យធាតុទី២.....។
    int numes[5]={100,200,300,400,500,};
    getch();
    return 0;
}
