//pointer and array4.c
#include<stdio.h>
#include<conio.h>
int main(){
    int a[10]={100,200,300,400,500,600,700,800,900,1000};
    int*p=a,*q=p+10;
    for(int i=1;p<q;p++)
        printf("\t%02d. %d %d\n",i++,p,*p);//%02dមានន័យថាតម្លៃiមានពីរខ្ទង់បើមានតែមួយខ្ទង់វានិងបន្ថែមលេខសូន្យនៅពីរខាងមុខ។
        printf("\n");
    p=a;
    for(int i=1;p<q;p+=2){
        printf("\t%02d.%d %d\n",i,p,*p);//%02dមានន័យថាតម្លៃiមានពីរខ្ទង់បើមានតែមួយខ្ទង់វានិងបន្ថែមលេខសូន្យនៅពីរខាងមុខ។
        i=i+2;
    }
    printf("\n");
    p=a;
    for(int i=1;p<q;p+=3){
        printf("\t%02d. %d %d\n",i,p,*p);//%02dមានន័យថាតម្លៃiមានពីរខ្ទង់បើមានតែមួយខ្ទង់វានិងបន្ថែមលេខសូន្យនៅពីរខាងមុខ។
        i=i+3;
    }
    printf("\n");
        getch();
        return 0;
}
/*
*ចំណាំ
ពេលpointer  ផ្ទុកអាសយដ្ធានរបស់​​   array នោះpointer+n  និងរំកិលទៅកាន់ធាតុnបន្តបន្ទប់។
*/
